# EnergyAnalysisSpaceBoundingParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..EnergyAnalysisSpaceBoundingParam Property
ParameterTypeId Class See Also
---
"Analytical Space Bounding"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisSpaceBoundingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisSpaceBoundingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisSpaceBoundingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace